MikroElektronika/core_packages/PIC/XC8/def/PIC16LF15386/mcu.h
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// RE0PPS<RE0PPS0>
extern volatile __bit                   RE0PPS0             __at(0xF980);	// @ (0x1F30 * 8 + 0)
#define                                 RE0PPS0_bit         _BIT_ACCESS(RE0PPS,0)
// RE0PPS<RE0PPS1>
extern volatile __bit                   RE0PPS1             __at(0xF981);	// @ (0x1F30 * 8 + 1)
#define                                 RE0PPS1_bit         _BIT_ACCESS(RE0PPS,1)
// RE0PPS<RE0PPS2>
extern volatile __bit                   RE0PPS2             __at(0xF982);	// @ (0x1F30 * 8 + 2)
#define                                 RE0PPS2_bit         _BIT_ACCESS(RE0PPS,2)
// RE0PPS<RE0PPS3>
extern volatile __bit                   RE0PPS3             __at(0xF983);	// @ (0x1F30 * 8 + 3)
#define                                 RE0PPS3_bit         _BIT_ACCESS(RE0PPS,3)
// RE0PPS<RE0PPS4>
extern volatile __bit                   RE0PPS4             __at(0xF984);	// @ (0x1F30 * 8 + 4)
#define                                 RE0PPS4_bit         _BIT_ACCESS(RE0PPS,4)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// RE1PPS<RE1PPS0>
extern volatile __bit                   RE1PPS0             __at(0xF988);	// @ (0x1F31 * 8 + 0)
#define                                 RE1PPS0_bit         _BIT_ACCESS(RE1PPS,0)
// RE1PPS<RE1PPS1>
extern volatile __bit                   RE1PPS1             __at(0xF989);	// @ (0x1F31 * 8 + 1)
#define                                 RE1PPS1_bit         _BIT_ACCESS(RE1PPS,1)
// RE1PPS<RE1PPS2>
extern volatile __bit                   RE1PPS2             __at(0xF98A);	// @ (0x1F31 * 8 + 2)
#define                                 RE1PPS2_bit         _BIT_ACCESS(RE1PPS,2)
// RE1PPS<RE1PPS3>
extern volatile __bit                   RE1PPS3             __at(0xF98B);	// @ (0x1F31 * 8 + 3)
#define                                 RE1PPS3_bit         _BIT_ACCESS(RE1PPS,3)
// RE1PPS<RE1PPS4>
extern volatile __bit                   RE1PPS4             __at(0xF98C);	// @ (0x1F31 * 8 + 4)
#define                                 RE1PPS4_bit         _BIT_ACCESS(RE1PPS,4)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// RE2PPS<RE2PPS0>
extern volatile __bit                   RE2PPS0             __at(0xF990);	// @ (0x1F32 * 8 + 0)
#define                                 RE2PPS0_bit         _BIT_ACCESS(RE2PPS,0)
// RE2PPS<RE2PPS1>
extern volatile __bit                   RE2PPS1             __at(0xF991);	// @ (0x1F32 * 8 + 1)
#define                                 RE2PPS1_bit         _BIT_ACCESS(RE2PPS,1)
// RE2PPS<RE2PPS2>
extern volatile __bit                   RE2PPS2             __at(0xF992);	// @ (0x1F32 * 8 + 2)
#define                                 RE2PPS2_bit         _BIT_ACCESS(RE2PPS,2)
// RE2PPS<RE2PPS3>
extern volatile __bit                   RE2PPS3             __at(0xF993);	// @ (0x1F32 * 8 + 3)
#define                                 RE2PPS3_bit         _BIT_ACCESS(RE2PPS,3)
// RE2PPS<RE2PPS4>
extern volatile __bit                   RE2PPS4             __at(0xF994);	// @ (0x1F32 * 8 + 4)
#define                                 RE2PPS4_bit         _BIT_ACCESS(RE2PPS,4)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0xCCA);	// @ (0x199 * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// PORTF<RF0>
extern volatile __bit                   RF0                 __at(0x88);	// @ (0x11 * 8 + 0)
#define                                 RF0_bit             _BIT_ACCESS(PORTF,0)
// RF0PPS<RF0PPS0>
extern volatile __bit                   RF0PPS0             __at(0xF1C0);	// @ (0x1E38 * 8 + 0)
#define                                 RF0PPS0_bit         _BIT_ACCESS(RF0PPS,0)
// RF0PPS<RF0PPS1>
extern volatile __bit                   RF0PPS1             __at(0xF1C1);	// @ (0x1E38 * 8 + 1)
#define                                 RF0PPS1_bit         _BIT_ACCESS(RF0PPS,1)
// RF0PPS<RF0PPS2>
extern volatile __bit                   RF0PPS2             __at(0xF1C2);	// @ (0x1E38 * 8 + 2)
#define                                 RF0PPS2_bit         _BIT_ACCESS(RF0PPS,2)
// RF0PPS<RF0PPS3>
extern volatile __bit                   RF0PPS3             __at(0xF1C3);	// @ (0x1E38 * 8 + 3)
#define                                 RF0PPS3_bit         _BIT_ACCESS(RF0PPS,3)
// RF0PPS<RF0PPS4>
extern volatile __bit                   RF0PPS4             __at(0xF1C4);	// @ (0x1E38 * 8 + 4)
#define                                 RF0PPS4_bit         _BIT_ACCESS(RF0PPS,4)
// PORTF<RF1>
extern volatile __bit                   RF1                 __at(0x89);	// @ (0x11 * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// RF1PPS<RF1PPS0>
extern volatile __bit                   RF1PPS0             __at(0xF1C8);	// @ (0x1E39 * 8 + 0)
#define                                 RF1PPS0_bit         _BIT_ACCESS(RF1PPS,0)
// RF1PPS<RF1PPS1>
extern volatile __bit                   RF1PPS1             __at(0xF1C9);	// @ (0x1E39 * 8 + 1)
#define                                 RF1PPS1_bit         _BIT_ACCESS(RF1PPS,1)
// RF1PPS<RF1PPS2>
extern volatile __bit                   RF1PPS2             __at(0xF1CA);	// @ (0x1E39 * 8 + 2)
#define                                 RF1PPS2_bit         _BIT_ACCESS(RF1PPS,2)
// RF1PPS<RF1PPS3>
extern volatile __bit                   RF1PPS3             __at(0xF1CB);	// @ (0x1E39 * 8 + 3)
#define                                 RF1PPS3_bit         _BIT_ACCESS(RF1PPS,3)
// RF1PPS<RF1PPS4>
extern volatile __bit                   RF1PPS4             __at(0xF1CC);	// @ (0x1E39 * 8 + 4)
#define                                 RF1PPS4_bit         _BIT_ACCESS(RF1PPS,4)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// RF2PPS<RF2PPS0>
extern volatile __bit                   RF2PPS0             __at(0xF1D0);	// @ (0x1E3A * 8 + 0)
#define                                 RF2PPS0_bit         _BIT_ACCESS(RF2PPS,0)
// RF2PPS<RF2PPS1>
extern volatile __bit                   RF2PPS1             __at(0xF1D1);	// @ (0x1E3A * 8 + 1)
#define                                 RF2PPS1_bit         _BIT_ACCESS(RF2PPS,1)
// RF2PPS<RF2PPS2>
extern volatile __bit                   RF2PPS2             __at(0xF1D2);	// @ (0x1E3A * 8 + 2)
#define                                 RF2PPS2_bit         _BIT_ACCESS(RF2PPS,2)
// RF2PPS<RF2PPS3>
extern volatile __bit                   RF2PPS3             __at(0xF1D3);	// @ (0x1E3A * 8 + 3)
#define                                 RF2PPS3_bit         _BIT_ACCESS(RF2PPS,3)
// RF2PPS<RF2PPS4>
extern volatile __bit                   RF2PPS4             __at(0xF1D4);	// @ (0x1E3A * 8 + 4)
#define                                 RF2PPS4_bit         _BIT_ACCESS(RF2PPS,4)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// RF3PPS<RF3PPS0>
extern volatile __bit                   RF3PPS0             __at(0xF1D8);	// @ (0x1E3B * 8 + 0)
#define                                 RF3PPS0_bit         _BIT_ACCESS(RF3PPS,0)
// RF3PPS<RF3PPS1>
extern volatile __bit                   RF3PPS1             __at(0xF1D9);	// @ (0x1E3B * 8 + 1)
#define                                 RF3PPS1_bit         _BIT_ACCESS(RF3PPS,1)
// RF3PPS<RF3PPS2>
extern volatile __bit                   RF3PPS2             __at(0xF1DA);	// @ (0x1E3B * 8 + 2)
#define                                 RF3PPS2_bit         _BIT_ACCESS(RF3PPS,2)
// RF3PPS<RF3PPS3>
extern volatile __bit                   RF3PPS3             __at(0xF1DB);	// @ (0x1E3B * 8 + 3)
#define                                 RF3PPS3_bit         _BIT_ACCESS(RF3PPS,3)
// RF3PPS<RF3PPS4>
extern volatile __bit                   RF3PPS4             __at(0xF1DC);	// @ (0x1E3B * 8 + 4)
#define                                 RF3PPS4_bit         _BIT_ACCESS(RF3PPS,4)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x8C);	// @ (0x11 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// RF4PPS<RF4PSS0>
extern volatile __bit                   RF4PSS0             __at(0xF1E0);	// @ (0x1E3C * 8 + 0)
#define                                 RF4PSS0_bit         _BIT_ACCESS(RF4PPS,0)
// RF4PPS<RF4PSS1>
extern volatile __bit                   RF4PSS1             __at(0xF1E1);	// @ (0x1E3C * 8 + 1)
#define                                 RF4PSS1_bit         _BIT_ACCESS(RF4PPS,1)
// RF4PPS<RF4PSS2>
extern volatile __bit                   RF4PSS2             __at(0xF1E2);	// @ (0x1E3C * 8 + 2)
#define                                 RF4PSS2_bit         _BIT_ACCESS(RF4PPS,2)
// RF4PPS<RF4PSS3>
extern volatile __bit                   RF4PSS3             __at(0xF1E3);	// @ (0x1E3C * 8 + 3)
#define                                 RF4PSS3_bit         _BIT_ACCESS(RF4PPS,3)
// RF4PPS<RF4PSS4>
extern volatile __bit                   RF4PSS4             __at(0xF1E4);	// @ (0x1E3C * 8 + 4)
#define                                 RF4PSS4_bit         _BIT_ACCESS(RF4PPS,4)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// RF5PPS<RF5PPS0>
extern volatile __bit                   RF5PPS0             __at(0xF1E8);	// @ (0x1E3D * 8 + 0)
#define                                 RF5PPS0_bit         _BIT_ACCESS(RF5PPS,0)
// RF5PPS<RF5PPS1>
extern volatile __bit                   RF5PPS1             __at(0xF1E9);	// @ (0x1E3D * 8 + 1)
#define                                 RF5PPS1_bit         _BIT_ACCESS(RF5PPS,1)
// RF5PPS<RF5PPS2>
extern volatile __bit                   RF5PPS2             __at(0xF1EA);	// @ (0x1E3D * 8 + 2)
#define                                 RF5PPS2_bit         _BIT_ACCESS(RF5PPS,2)
// RF5PPS<RF5PPS3>
extern volatile __bit                   RF5PPS3             __at(0xF1EB);	// @ (0x1E3D * 8 + 3)
#define                                 RF5PPS3_bit         _BIT_ACCESS(RF5PPS,3)
// RF5PPS<RF5PPS4>
extern volatile __bit                   RF5PPS4             __at(0xF1EC);	// @ (0x1E3D * 8 + 4)
#define                                 RF5PPS4_bit         _BIT_ACCESS(RF5PPS,4)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// RF6PPS<RF6PPS0>
extern volatile __bit                   RF6PPS0             __at(0xF1F0);	// @ (0x1E3E * 8 + 0)
#define                                 RF6PPS0_bit         _BIT_ACCESS(RF6PPS,0)
// RF6PPS<RF6PPS1>
extern volatile __bit                   RF6PPS1             __at(0xF1F1);	// @ (0x1E3E * 8 + 1)
#define                                 RF6PPS1_bit         _BIT_ACCESS(RF6PPS,1)
// RF6PPS<RF6PPS2>
extern volatile __bit                   RF6PPS2             __at(0xF1F2);	// @ (0x1E3E * 8 + 2)
#define                                 RF6PPS2_bit         _BIT_ACCESS(RF6PPS,2)
// RF6PPS<RF6PPS3>
extern volatile __bit                   RF6PPS3             __at(0xF1F3);	// @ (0x1E3E * 8 + 3)
#define                                 RF6PPS3_bit         _BIT_ACCESS(RF6PPS,3)
// RF6PPS<RF6PPS4>
extern volatile __bit                   RF6PPS4             __at(0xF1F4);	// @ (0x1E3E * 8 + 4)
#define                                 RF6PPS4_bit         _BIT_ACCESS(RF6PPS,4)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x8F);	// @ (0x11 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// RF7PPS<RF7PPS0>
extern volatile __bit                   RF7PPS0             __at(0xF1F8);	// @ (0x1E3F * 8 + 0)
#define                                 RF7PPS0_bit         _BIT_ACCESS(RF7PPS,0)
// RF7PPS<RF7PPS1>
extern volatile __bit                   RF7PPS1             __at(0xF1F9);	// @ (0x1E3F * 8 + 1)
#define                                 RF7PPS1_bit         _BIT_ACCESS(RF7PPS,1)
// RF7PPS<RF7PPS2>
extern volatile __bit                   RF7PPS2             __at(0xF1FA);	// @ (0x1E3F * 8 + 2)
#define                                 RF7PPS2_bit         _BIT_ACCESS(RF7PPS,2)
// RF7PPS<RF7PPS3>
extern volatile __bit                   RF7PPS3             __at(0xF1FB);	// @ (0x1E3F * 8 + 3)
#define                                 RF7PPS3_bit         _BIT_ACCESS(RF7PPS,3)
// RF7PPS<RF7PPS4>
extern volatile __bit                   RF7PPS4             __at(0xF1FC);	// @ (0x1E3F * 8 + 4)
#define                                 RF7PPS4_bit         _BIT_ACCESS(RF7PPS,4)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x4465);	// @ (0x88C * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// T2RST<RSEL0>
extern volatile __bit                   RSEL0               __at(0x1488);	// @ (0x291 * 8 + 0)
#define                                 RSEL0_bit           _BIT_ACCESS(T2RST,0)
// T2RST<RSEL1>
extern volatile __bit                   RSEL1               __at(0x1489);	// @ (0x291 * 8 + 1)
#define                                 RSEL1_bit           _BIT_ACCESS(T2RST,1)
// T2RST<RSEL2>
extern volatile __bit                   RSEL2               __at(0x148A);	// @ (0x291 * 8 + 2)
#define                                 RSEL2_bit           _BIT_ACCESS(T2RST,2)
// T2RST<RSEL3>
extern volatile __bit                   RSEL3               __at(0x148B);	// @ (0x291 * 8 + 3)
#define                                 RSEL3_bit           _BIT_ACCESS(T2RST,3)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0xC89);	// @ (0x191 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0xCD9);	// @ (0x19B * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0xCCA);	// @ (0x199 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// RX1DTPPS<RX1DTPPS0>
extern volatile __bit                   RX1DTPPS0           __at(0xF658);	// @ (0x1ECB * 8 + 0)
#define                                 RX1DTPPS0_bit       _BIT_ACCESS(RX1DTPPS,0)
// RX1DTPPS<RX1DTPPS1>
extern volatile __bit                   RX1DTPPS1           __at(0xF659);	// @ (0x1ECB * 8 + 1)
#define                                 RX1DTPPS1_bit       _BIT_ACCESS(RX1DTPPS,1)
// RX1DTPPS<RX1DTPPS2>
extern volatile __bit                   RX1DTPPS2           __at(0xF65A);	// @ (0x1ECB * 8 + 2)
#define                                 RX1DTPPS2_bit       _BIT_ACCESS(RX1DTPPS,2)
// RX1DTPPS<RX1DTPPS3>
extern volatile __bit                   RX1DTPPS3           __at(0xF65B);	// @ (0x1ECB * 8 + 3)
#define                                 RX1DTPPS3_bit       _BIT_ACCESS(RX1DTPPS,3)
// RX1DTPPS<RX1DTPPS4>
extern volatile __bit                   RX1DTPPS4           __at(0xF65C);	// @ (0x1ECB * 8 + 4)
#define                                 RX1DTPPS4_bit       _BIT_ACCESS(RX1DTPPS,4)
// RX1DTPPS<RX1DTPPS5>
extern volatile __bit                   RX1DTPPS5           __at(0xF65D);	// @ (0x1ECB * 8 + 5)
#define                                 RX1DTPPS5_bit       _BIT_ACCESS(RX1DTPPS,5)
// RX2DTPPS<RX2DTPPS0>
extern volatile __bit                   RX2DTPPS0           __at(0xF668);	// @ (0x1ECD * 8 + 0)
#define                                 RX2DTPPS0_bit       _BIT_ACCESS(RX2DTPPS,0)
// RX2DTPPS<RX2DTPPS1>
extern volatile __bit                   RX2DTPPS1           __at(0xF669);	// @ (0x1ECD * 8 + 1)
#define                                 RX2DTPPS1_bit       _BIT_ACCESS(RX2DTPPS,1)
// RX2DTPPS<RX2DTPPS2>
extern volatile __bit                   RX2DTPPS2           __at(0xF66A);	// @ (0x1ECD * 8 + 2)
#define                                 RX2DTPPS2_bit       _BIT_ACCESS(RX2DTPPS,2)
// RX2DTPPS<RX2DTPPS3>
extern volatile __bit                   RX2DTPPS3           __at(0xF66B);	// @ (0x1ECD * 8 + 3)
#define                                 RX2DTPPS3_bit       _BIT_ACCESS(RX2DTPPS,3)
// RX2DTPPS<RX2DTPPS4>
extern volatile __bit                   RX2DTPPS4           __at(0xF66C);	// @ (0x1ECD * 8 + 4)
#define                                 RX2DTPPS4_bit       _BIT_ACCESS(RX2DTPPS,4)
// RX2DTPPS<RX2DTPPS5>
extern volatile __bit                   RX2DTPPS5           __at(0xF66D);	// @ (0x1ECD * 8 + 5)
#define                                 RX2DTPPS5_bit       _BIT_ACCESS(RX2DTPPS,5)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0xCCA);	// @ (0x199 * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0xCCA);	// @ (0x199 * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0xC88);	// @ (0x191 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// SSP2CON2<SEN2>
extern volatile __bit                   SEN2                __at(0xCD8);	// @ (0x19B * 8 + 0)
#define                                 SEN2_bit            _BIT_ACCESS(SSP2CON2,0)
// CWG1AS0<SHUTDOWN>
extern volatile __bit                   SHUTDOWN            __at(0x3097);	// @ (0x612 * 8 + 7)
#define                                 SHUTDOWN_bit        _BIT_ACCESS(CWG1AS0,7)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0xF9D8);	// @ (0x1F3B * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0xF9D9);	// @ (0x1F3B * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0xF9DA);	// @ (0x1F3B * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0xF9DB);	// @ (0x1F3B * 8 + 3)
#define                                 SLRA3_bit           _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0xF9DC);	// @ (0x1F3B * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0xF9DD);	// @ (0x1F3B * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRA6>
extern volatile __bit                   SLRA6               __at(0xF9DE);	// @ (0x1F3B * 8 + 6)
#define                                 SLRA6_bit           _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRA7>
extern volatile __bit                   SLRA7               __at(0xF9DF);	// @ (0x1F3B * 8 + 7)
#define                                 SLRA7_bit           _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRB0>
extern volatile __bit                   SLRB0               __at(0xFA30);	// @ (0x1F46 * 8 + 0)
#define                                 SLRB0_bit           _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRB1>
extern volatile __bit                   SLRB1               __at(0xFA31);	// @ (0x1F46 * 8 + 1)
#define                                 SLRB1_bit           _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRB2>
extern volatile __bit                   SLRB2               __at(0xFA32);	// @ (0x1F46 * 8 + 2)
#define                                 SLRB2_bit           _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRB3>
extern volatile __bit                   SLRB3               __at(0xFA33);	// @ (0x1F46 * 8 + 3)
#define                                 SLRB3_bit           _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0xFA34);	// @ (0x1F46 * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0xFA35);	// @ (0x1F46 * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0xFA36);	// @ (0x1F46 * 8 + 6)
#define                                 SLRB6_bit           _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0xFA37);	// @ (0x1F46 * 8 + 7)
#define                                 SLRB7_bit           _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0xFA88);	// @ (0x1F51 * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0xFA89);	// @ (0x1F51 * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0xFA8A);	// @ (0x1F51 * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0xFA8B);	// @ (0x1F51 * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0xFA8C);	// @ (0x1F51 * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0xFA8D);	// @ (0x1F51 * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRC6>
extern volatile __bit                   SLRC6               __at(0xFA8E);	// @ (0x1F51 * 8 + 6)
#define                                 SLRC6_bit           _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRC7>
