MikroElektronika/core_packages/PIC/XC8/def/PIC16LF15386/mcu.h
extern volatile __bit                   SLRC7               __at(0xFA8F);	// @ (0x1F51 * 8 + 7)
#define                                 SLRC7_bit           _BIT_ACCESS(SLRCONC,7)
// SLRCOND<SLRD0>
extern volatile __bit                   SLRD0               __at(0xFAE0);	// @ (0x1F5C * 8 + 0)
#define                                 SLRD0_bit           _BIT_ACCESS(SLRCOND,0)
// SLRCOND<SLRD1>
extern volatile __bit                   SLRD1               __at(0xFAE1);	// @ (0x1F5C * 8 + 1)
#define                                 SLRD1_bit           _BIT_ACCESS(SLRCOND,1)
// SLRCOND<SLRD2>
extern volatile __bit                   SLRD2               __at(0xFAE2);	// @ (0x1F5C * 8 + 2)
#define                                 SLRD2_bit           _BIT_ACCESS(SLRCOND,2)
// SLRCOND<SLRD3>
extern volatile __bit                   SLRD3               __at(0xFAE3);	// @ (0x1F5C * 8 + 3)
#define                                 SLRD3_bit           _BIT_ACCESS(SLRCOND,3)
// SLRCOND<SLRD4>
extern volatile __bit                   SLRD4               __at(0xFAE4);	// @ (0x1F5C * 8 + 4)
#define                                 SLRD4_bit           _BIT_ACCESS(SLRCOND,4)
// SLRCOND<SLRD5>
extern volatile __bit                   SLRD5               __at(0xFAE5);	// @ (0x1F5C * 8 + 5)
#define                                 SLRD5_bit           _BIT_ACCESS(SLRCOND,5)
// SLRCOND<SLRD6>
extern volatile __bit                   SLRD6               __at(0xFAE6);	// @ (0x1F5C * 8 + 6)
#define                                 SLRD6_bit           _BIT_ACCESS(SLRCOND,6)
// SLRCOND<SLRD7>
extern volatile __bit                   SLRD7               __at(0xFAE7);	// @ (0x1F5C * 8 + 7)
#define                                 SLRD7_bit           _BIT_ACCESS(SLRCOND,7)
// SLRCONE<SLRE0>
extern volatile __bit                   SLRE0               __at(0xFB38);	// @ (0x1F67 * 8 + 0)
#define                                 SLRE0_bit           _BIT_ACCESS(SLRCONE,0)
// SLRCONE<SLRE1>
extern volatile __bit                   SLRE1               __at(0xFB39);	// @ (0x1F67 * 8 + 1)
#define                                 SLRE1_bit           _BIT_ACCESS(SLRCONE,1)
// SLRCONE<SLRE2>
extern volatile __bit                   SLRE2               __at(0xFB3A);	// @ (0x1F67 * 8 + 2)
#define                                 SLRE2_bit           _BIT_ACCESS(SLRCONE,2)
// SLRCONF<SLRF0>
extern volatile __bit                   SLRF0               __at(0xF298);	// @ (0x1E53 * 8 + 0)
#define                                 SLRF0_bit           _BIT_ACCESS(SLRCONF,0)
// SLRCONF<SLRF1>
extern volatile __bit                   SLRF1               __at(0xF299);	// @ (0x1E53 * 8 + 1)
#define                                 SLRF1_bit           _BIT_ACCESS(SLRCONF,1)
// SLRCONF<SLRF2>
extern volatile __bit                   SLRF2               __at(0xF29A);	// @ (0x1E53 * 8 + 2)
#define                                 SLRF2_bit           _BIT_ACCESS(SLRCONF,2)
// SLRCONF<SLRF3>
extern volatile __bit                   SLRF3               __at(0xF29B);	// @ (0x1E53 * 8 + 3)
#define                                 SLRF3_bit           _BIT_ACCESS(SLRCONF,3)
// SLRCONF<SLRF4>
extern volatile __bit                   SLRF4               __at(0xF29C);	// @ (0x1E53 * 8 + 4)
#define                                 SLRF4_bit           _BIT_ACCESS(SLRCONF,4)
// SLRCONF<SLRF5>
extern volatile __bit                   SLRF5               __at(0xF29D);	// @ (0x1E53 * 8 + 5)
#define                                 SLRF5_bit           _BIT_ACCESS(SLRCONF,5)
// SLRCONF<SLRF6>
extern volatile __bit                   SLRF6               __at(0xF29E);	// @ (0x1E53 * 8 + 6)
#define                                 SLRF6_bit           _BIT_ACCESS(SLRCONF,6)
// SLRCONF<SLRF7>
extern volatile __bit                   SLRF7               __at(0xF29F);	// @ (0x1E53 * 8 + 7)
#define                                 SLRF7_bit           _BIT_ACCESS(SLRCONF,7)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0xC7F);	// @ (0x18F * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0xCCF);	// @ (0x199 * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x4483);	// @ (0x890 * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x448B);	// @ (0x891 * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x447E);	// @ (0x88F * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// SSP1CLKPPS<SSP1CLKPPS0>
extern volatile __bit                   SSP1CLKPPS0         __at(0xF628);	// @ (0x1EC5 * 8 + 0)
#define                                 SSP1CLKPPS0_bit     _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSP1CLKPPS1>
extern volatile __bit                   SSP1CLKPPS1         __at(0xF629);	// @ (0x1EC5 * 8 + 1)
#define                                 SSP1CLKPPS1_bit     _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSP1CLKPPS2>
extern volatile __bit                   SSP1CLKPPS2         __at(0xF62A);	// @ (0x1EC5 * 8 + 2)
#define                                 SSP1CLKPPS2_bit     _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSP1CLKPPS3>
extern volatile __bit                   SSP1CLKPPS3         __at(0xF62B);	// @ (0x1EC5 * 8 + 3)
#define                                 SSP1CLKPPS3_bit     _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSP1CLKPPS4>
extern volatile __bit                   SSP1CLKPPS4         __at(0xF62C);	// @ (0x1EC5 * 8 + 4)
#define                                 SSP1CLKPPS4_bit     _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1CLKPPS<SSP1CLKPPS5>
extern volatile __bit                   SSP1CLKPPS5         __at(0xF62D);	// @ (0x1EC5 * 8 + 5)
#define                                 SSP1CLKPPS5_bit     _BIT_ACCESS(SSP1CLKPPS,5)
// SSP1DATPPS<SSP1DATPPS0>
extern volatile __bit                   SSP1DATPPS0         __at(0xF630);	// @ (0x1EC6 * 8 + 0)
#define                                 SSP1DATPPS0_bit     _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSP1DATPPS1>
extern volatile __bit                   SSP1DATPPS1         __at(0xF631);	// @ (0x1EC6 * 8 + 1)
#define                                 SSP1DATPPS1_bit     _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSP1DATPPS2>
extern volatile __bit                   SSP1DATPPS2         __at(0xF632);	// @ (0x1EC6 * 8 + 2)
#define                                 SSP1DATPPS2_bit     _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSP1DATPPS3>
extern volatile __bit                   SSP1DATPPS3         __at(0xF633);	// @ (0x1EC6 * 8 + 3)
#define                                 SSP1DATPPS3_bit     _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSP1DATPPS4>
extern volatile __bit                   SSP1DATPPS4         __at(0xF634);	// @ (0x1EC6 * 8 + 4)
#define                                 SSP1DATPPS4_bit     _BIT_ACCESS(SSP1DATPPS,4)
// SSP1DATPPS<SSP1DATPPS5>
extern volatile __bit                   SSP1DATPPS5         __at(0xF635);	// @ (0x1EC6 * 8 + 5)
#define                                 SSP1DATPPS5_bit     _BIT_ACCESS(SSP1DATPPS,5)
// PIE3<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x3878);	// @ (0x70F * 8 + 0)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR3,0)
// SSP1SSPPS<SSP1SSPPS0>
extern volatile __bit                   SSP1SSPPS0          __at(0xF638);	// @ (0x1EC7 * 8 + 0)
#define                                 SSP1SSPPS0_bit      _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSP1SSPPS1>
extern volatile __bit                   SSP1SSPPS1          __at(0xF639);	// @ (0x1EC7 * 8 + 1)
#define                                 SSP1SSPPS1_bit      _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSP1SSPPS2>
extern volatile __bit                   SSP1SSPPS2          __at(0xF63A);	// @ (0x1EC7 * 8 + 2)
#define                                 SSP1SSPPS2_bit      _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSP1SSPPS3>
extern volatile __bit                   SSP1SSPPS3          __at(0xF63B);	// @ (0x1EC7 * 8 + 3)
#define                                 SSP1SSPPS3_bit      _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSP1SSPPS4>
extern volatile __bit                   SSP1SSPPS4          __at(0xF63C);	// @ (0x1EC7 * 8 + 4)
#define                                 SSP1SSPPS4_bit      _BIT_ACCESS(SSP1SSPPS,4)
// SSP1SSPPS<SSP1SSPPS5>
extern volatile __bit                   SSP1SSPPS5          __at(0xF63D);	// @ (0x1EC7 * 8 + 5)
#define                                 SSP1SSPPS5_bit      _BIT_ACCESS(SSP1SSPPS,5)
// SSP2CLKPPS<SSP2CLKPPS0>
extern volatile __bit                   SSP2CLKPPS0         __at(0xF640);	// @ (0x1EC8 * 8 + 0)
#define                                 SSP2CLKPPS0_bit     _BIT_ACCESS(SSP2CLKPPS,0)
// SSP2CLKPPS<SSP2CLKPPS1>
extern volatile __bit                   SSP2CLKPPS1         __at(0xF641);	// @ (0x1EC8 * 8 + 1)
#define                                 SSP2CLKPPS1_bit     _BIT_ACCESS(SSP2CLKPPS,1)
// SSP2CLKPPS<SSP2CLKPPS2>
extern volatile __bit                   SSP2CLKPPS2         __at(0xF642);	// @ (0x1EC8 * 8 + 2)
#define                                 SSP2CLKPPS2_bit     _BIT_ACCESS(SSP2CLKPPS,2)
// SSP2CLKPPS<SSP2CLKPPS3>
extern volatile __bit                   SSP2CLKPPS3         __at(0xF643);	// @ (0x1EC8 * 8 + 3)
#define                                 SSP2CLKPPS3_bit     _BIT_ACCESS(SSP2CLKPPS,3)
// SSP2CLKPPS<SSP2CLKPPS4>
extern volatile __bit                   SSP2CLKPPS4         __at(0xF644);	// @ (0x1EC8 * 8 + 4)
#define                                 SSP2CLKPPS4_bit     _BIT_ACCESS(SSP2CLKPPS,4)
// SSP2CLKPPS<SSP2CLKPPS5>
extern volatile __bit                   SSP2CLKPPS5         __at(0xF645);	// @ (0x1EC8 * 8 + 5)
#define                                 SSP2CLKPPS5_bit     _BIT_ACCESS(SSP2CLKPPS,5)
// SSP2DATPPS<SSP2DATPPS0>
extern volatile __bit                   SSP2DATPPS0         __at(0xF648);	// @ (0x1EC9 * 8 + 0)
#define                                 SSP2DATPPS0_bit     _BIT_ACCESS(SSP2DATPPS,0)
// SSP2DATPPS<SSP2DATPPS1>
extern volatile __bit                   SSP2DATPPS1         __at(0xF649);	// @ (0x1EC9 * 8 + 1)
#define                                 SSP2DATPPS1_bit     _BIT_ACCESS(SSP2DATPPS,1)
// SSP2DATPPS<SSP2DATPPS2>
extern volatile __bit                   SSP2DATPPS2         __at(0xF64A);	// @ (0x1EC9 * 8 + 2)
#define                                 SSP2DATPPS2_bit     _BIT_ACCESS(SSP2DATPPS,2)
// SSP2DATPPS<SSP2DATPPS3>
extern volatile __bit                   SSP2DATPPS3         __at(0xF64B);	// @ (0x1EC9 * 8 + 3)
#define                                 SSP2DATPPS3_bit     _BIT_ACCESS(SSP2DATPPS,3)
// SSP2DATPPS<SSP2DATPPS4>
extern volatile __bit                   SSP2DATPPS4         __at(0xF64C);	// @ (0x1EC9 * 8 + 4)
#define                                 SSP2DATPPS4_bit     _BIT_ACCESS(SSP2DATPPS,4)
// SSP2DATPPS<SSP2DATPPS5>
extern volatile __bit                   SSP2DATPPS5         __at(0xF64D);	// @ (0x1EC9 * 8 + 5)
#define                                 SSP2DATPPS5_bit     _BIT_ACCESS(SSP2DATPPS,5)
// PIE3<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x387A);	// @ (0x70F * 8 + 2)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR3,2)
// SSP2SSPPS<SSP2SSPPS0>
extern volatile __bit                   SSP2SSPPS0          __at(0xF650);	// @ (0x1ECA * 8 + 0)
#define                                 SSP2SSPPS0_bit      _BIT_ACCESS(SSP2SSPPS,0)
// SSP2SSPPS<SSP2SSPPS1>
extern volatile __bit                   SSP2SSPPS1          __at(0xF651);	// @ (0x1ECA * 8 + 1)
#define                                 SSP2SSPPS1_bit      _BIT_ACCESS(SSP2SSPPS,1)
// SSP2SSPPS<SSP2SSPPS2>
extern volatile __bit                   SSP2SSPPS2          __at(0xF652);	// @ (0x1ECA * 8 + 2)
#define                                 SSP2SSPPS2_bit      _BIT_ACCESS(SSP2SSPPS,2)
// SSP2SSPPS<SSP2SSPPS3>
extern volatile __bit                   SSP2SSPPS3          __at(0xF653);	// @ (0x1ECA * 8 + 3)
#define                                 SSP2SSPPS3_bit      _BIT_ACCESS(SSP2SSPPS,3)
// SSP2SSPPS<SSP2SSPPS4>
extern volatile __bit                   SSP2SSPPS4          __at(0xF654);	// @ (0x1ECA * 8 + 4)
#define                                 SSP2SSPPS4_bit      _BIT_ACCESS(SSP2SSPPS,4)
// SSP2SSPPS<SSP2SSPPS5>
extern volatile __bit                   SSP2SSPPS5          __at(0xF655);	// @ (0x1ECA * 8 + 5)
#define                                 SSP2SSPPS5_bit      _BIT_ACCESS(SSP2SSPPS,5)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0xC85);	// @ (0x190 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0xCD5);	// @ (0x19A * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0xC80);	// @ (0x190 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0xCD0);	// @ (0x19A * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0xC81);	// @ (0x190 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0xCD1);	// @ (0x19A * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0xC82);	// @ (0x190 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0xCD2);	// @ (0x19A * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0xC83);	// @ (0x190 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0xCD3);	// @ (0x19A * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0xC86);	// @ (0x190 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0xCD6);	// @ (0x19A * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0xC7B);	// @ (0x18F * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0xCCB);	// @ (0x199 * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x409F);	// @ (0x813 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0xFF68);	// @ (0x1FED * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0xFF69);	// @ (0x1FED * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0xFF6A);	// @ (0x1FED * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0xFF6B);	// @ (0x1FED * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0xFF6C);	// @ (0x1FED * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x409E);	// @ (0x813 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0xC7C);	// @ (0x18F * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0xCCC);	// @ (0x199 * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// CWG1STR<STRA>
extern volatile __bit                   STRA                __at(0x30A0);	// @ (0x614 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1STR,0)
// CWG1STR<STRB>
extern volatile __bit                   STRB                __at(0x30A1);	// @ (0x614 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1STR,1)
// CWG1STR<STRC>
extern volatile __bit                   STRC                __at(0x30A2);	// @ (0x614 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1STR,2)
// CWG1STR<STRD>
extern volatile __bit                   STRD                __at(0x30A3);	// @ (0x614 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1STR,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x4060);	// @ (0x80C * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x3CB7);	// @ (0x796 * 8 + 7)
#define                                 SYSCMD_bit          _BIT_ACCESS(PMD0,7)
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0x2CF4);	// @ (0x59E * 8 + 4)
#define                                 T016BIT_bit         _BIT_ACCESS(T0CON0,4)
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0x2CFC);	// @ (0x59F * 8 + 4)
#define                                 T0ASYNC_bit         _BIT_ACCESS(T0CON1,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0xF488);	// @ (0x1E91 * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0xF489);	// @ (0x1E91 * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0xF48A);	// @ (0x1E91 * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0xF48B);	// @ (0x1E91 * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CKIPPS<T0CKIPPS4>
extern volatile __bit                   T0CKIPPS4           __at(0xF48C);	// @ (0x1E91 * 8 + 4)
#define                                 T0CKIPPS4_bit       _BIT_ACCESS(T0CKIPPS,4)
// T0CKIPPS<T0CKIPPS5>
extern volatile __bit                   T0CKIPPS5           __at(0xF48D);	// @ (0x1E91 * 8 + 5)
#define                                 T0CKIPPS5_bit       _BIT_ACCESS(T0CKIPPS,5)
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0x2CF8);	// @ (0x59F * 8 + 0)
#define                                 T0CKPS0_bit         _BIT_ACCESS(T0CON1,0)
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0x2CF9);	// @ (0x59F * 8 + 1)
#define                                 T0CKPS1_bit         _BIT_ACCESS(T0CON1,1)
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0x2CFA);	// @ (0x59F * 8 + 2)
#define                                 T0CKPS2_bit         _BIT_ACCESS(T0CON1,2)
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0x2CFB);	// @ (0x59F * 8 + 3)
#define                                 T0CKPS3_bit         _BIT_ACCESS(T0CON1,3)
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0x2CFD);	// @ (0x59F * 8 + 5)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON1,5)
// T0CON1<T0CS1>
extern volatile __bit                   T0CS1               __at(0x2CFE);	// @ (0x59F * 8 + 6)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON1,6)
// T0CON1<T0CS2>
extern volatile __bit                   T0CS2               __at(0x2CFF);	// @ (0x59F * 8 + 7)
#define                                 T0CS2_bit           _BIT_ACCESS(T0CON1,7)
// T0CON0<T0EN>
extern volatile __bit                   T0EN                __at(0x2CF7);	// @ (0x59E * 8 + 7)
#define                                 T0EN_bit            _BIT_ACCESS(T0CON0,7)
// T0CON0<T0OE>
extern volatile __bit                   T0OE                __at(0x2CF6);	// @ (0x59E * 8 + 6)
#define                                 T0OE_bit            _BIT_ACCESS(T0CON0,6)
// T0CON0<T0OUT>
extern volatile __bit                   T0OUT               __at(0x2CF5);	// @ (0x59E * 8 + 5)
#define                                 T0OUT_bit           _BIT_ACCESS(T0CON0,5)
// T0CON0<T0OUTPS0>
extern volatile __bit                   T0OUTPS0            __at(0x2CF0);	// @ (0x59E * 8 + 0)
#define                                 T0OUTPS0_bit        _BIT_ACCESS(T0CON0,0)
// T0CON0<T0OUTPS1>
extern volatile __bit                   T0OUTPS1            __at(0x2CF1);	// @ (0x59E * 8 + 1)
#define                                 T0OUTPS1_bit        _BIT_ACCESS(T0CON0,1)
// T0CON0<T0OUTPS2>
extern volatile __bit                   T0OUTPS2            __at(0x2CF2);	// @ (0x59E * 8 + 2)
#define                                 T0OUTPS2_bit        _BIT_ACCESS(T0CON0,2)
// T0CON0<T0OUTPS3>
extern volatile __bit                   T0OUTPS3            __at(0x2CF3);	// @ (0x59E * 8 + 3)
#define                                 T0OUTPS3_bit        _BIT_ACCESS(T0CON0,3)
// TMR0H<T0PR0>
extern volatile __bit                   T0PR0               __at(0x2CE8);	// @ (0x59D * 8 + 0)
#define                                 T0PR0_bit           _BIT_ACCESS(TMR0H,0)
// TMR0H<T0PR1>
extern volatile __bit                   T0PR1               __at(0x2CE9);	// @ (0x59D * 8 + 1)
#define                                 T0PR1_bit           _BIT_ACCESS(TMR0H,1)
// TMR0H<T0PR2>
extern volatile __bit                   T0PR2               __at(0x2CEA);	// @ (0x59D * 8 + 2)
#define                                 T0PR2_bit           _BIT_ACCESS(TMR0H,2)
// TMR0H<T0PR3>
